docs/posts/2023-01-23-styling-arguments-in-org-mode.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Styling Arguments in Org Mode</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Styling Arguments in Org Mode</h1>
<p class="subtitle" role="doc-subtitle">Jan 23, 2023</p>
</header><p>
Org mode is particularly useful for its ability to easily export to many other file formats. I often prepare handouts that contain philosophical arguments. Some of these handouts are intended to be printed, others are intended to be viewed electronically. Printed handouts are prepared by exporting the org file to PDF using LaTeX, and the other handouts are made by exporting to HTML.
</p>

<p>
We often put arguments in what is called &ldquo;standard form.&rdquo; The premises are written on numbered lines, with a line underneath the last premise. The conclusion is then written beneath the line. In LaTeX, this is easily done with this code:
</p>

<div class="org-src-container">
<pre class="src src-latex">\begin{enumerate}
\item First Premise
\item \underline{Last Premise}
\item [$\therefore$] Conclusion
\end{enumerate}
</pre>
</div>

<p>
For HTML, I use a class  that I named &ldquo;arg&rdquo; and defined in my custom css file:
</p>

<div class="org-src-container">
<pre class="src src-css">.arg li:last-child {
  list-style: none;
}

.arg li:nth-last-child(2) {
  text-decoration: underline;
}

.arg li {
  margin: 0px;
}
</pre>
</div>


<p>
This tells the rendering engine to not put any number before the last item of a list (nor any other styling) and to underline the penultimate item of the list. 
</p>

<p>
To use an HTML class in org mode, just put this immediately before the element you want to style:
</p>

<div class="org-src-container">
<pre class="src src-org">#+ATTR_HTML: :class classname
</pre>
</div>

<p>
The argument is written like this:
</p>

<pre class="example">
#+ATTR_HTML: :class arg
1. First premise
2. Second premise
3. Conclusion
</pre>

<p>
which produces this:
</p>

<ol class="org-ol arg">
<li>First premise</li>
<li>Second premise</li>
<li>Conclusion</li>
</ol>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
